tap "apparition47/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "gcc"
brew "gdal"
brew "gnupg"
brew "pinentry-mac"
brew "hugo"
brew "jags"
brew "mas"
brew "node"
brew "pdftk-java"
brew "r"
brew "udunits"
brew "vim"
brew "wget"
brew "wrangler"
brew "yadm"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "adguard"
cask "alfred"
cask "appcleaner"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "microsoft-edge"
cask "qlmarkdown"
cask "switchkey"
cask "thunder"
cask "visual-studio-code"
cask "zotero"

mas "CleanMyDrive 2", id: 523620159
mas "Maipo", id: 789066512
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "QQ", id: 451108668
mas "Telegram", id: 747648890
mas "Twitter", id: 1482454543
mas "Vimari", id: 1480933944
mas "微信", id: 836500024
mas "爱奇艺", id: 1012296988
mas "网易云音乐", id: 944848654
mas "腾讯视频", id: 1231336508

# These two should be downloaded manually from US Mac App Store
# mas "Unclutter", id: 577085396
# mas "PopClip", id: 445189367
