tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "wget"
brew "r"
brew "openssl"
brew "gdal"
brew "jags"
brew "gnupg"
brew "node"
brew "udunits"
brew "hugo"
brew "mas"

cask "font-fira-code"
cask "font-ubuntu"
cask "iina"
cask "karabiner-elements"
cask "monitorcontrol"
cask "rdm"
cask "qlmarkdown"
cask "appcleaner"
cask "rstudio"
cask "visual-studio-code"
cask "alfred"
cask "betterzip"
cask "cyberduck"
cask "hackintool"
cask "zotero"
cask "thunder"
cask "microsoft-edge"
cask "adguard"

mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Maipo", id: 789066512
mas "QQ", id: 451108668
mas "Telegram", id: 747648890
mas "Twitter", id: 1482454543
mas "微信", id: 836500024
mas "爱奇艺", id: 1012296988
mas "网易云音乐", id: 944848654
mas "腾讯视频", id: 1231336508
mas "CleanMyDrive 2", id: 523620159

# These two should be downloaded from US Mac App Store
# mas "Unclutter", id: 577085396
# mas "PopClip", id: 445189367